Repository: taku0/lambda_ja
Catalog: lambda_ja-level1.tmx
Source language: en_us
Languages: ja

source: The resulting {@code Collector} has the {@code Collector.Characteristics.IDENTITY_FINISH} characteristic.
ja: 結果となる{@code Collector}は{@code Collector.Characteristics.IDENTITY_FINISH}特性を備える。

source: The returned {@code Collector} is not concurrent.
ja: 返される{@code Collector}は並行的ではない。

source: The simplest, but least performant, way to create a spliterator is to create one from an iterator using {@link java.util.Spliterators#spliteratorUnknownSize(java.util.Iterator, int)}.
ja: スプリッテレータと作るのに最も簡単であるが最も非効率的な方法はイテレータから{@link java.util.Spliterators#spliteratorUnknownSize(java.util.Iterator, int)}を使って作る方法である。

source: The spliterator is obtained from the supplier only after the terminal operation of the stream pipeline commences.
ja: スプリッテレータはストリームパイプラインの末端処理が開始した後にのみ提供者から取得される。

source: The spliterator is only traversed, split, or queried for estimated size after the terminal operation of the stream pipeline commences.
ja: スプリッテレータはストリープパイプラインの末端処理が開始した後にのみ走査・分割・推定サイズの問い合わせをされる。

source: The stream implementations in the JDK create serial streams unless parallelism is explicitly requested.
ja: JDKで実装されている{@code Stream}は並列性が明示的に要求されない限り逐次ストリームを作成する。

source: The stream is parallel;
ja: ストリームが並列である。

source: The streams classes have multiple forms of general reduction operations, called {@link java.util.stream.Stream#reduce(java.util.function.BinaryOperator) reduce()} and {@link java.util.stream.Stream#collect(java.util.stream.Collector) collect()}, as well as multiple specialized reduction forms such as {@link java.util.stream.IntStream#sum() sum()}, {@link java.util.stream.IntStream#max() max()}, or {@link java.util.stream.IntStream#count() count()}.
ja: ストリームクラスは{@link java.util.stream.Stream#reduce(java.util.function.BinaryOperator) reduce()}および{@link java.util.stream.Stream#collect(java.util.stream.Collector) collect()}という複数の形式の汎用簡約処理を備える。また、{@link java.util.stream.IntStream#sum() sum()}, {@link java.util.stream.IntStream#max() max()}, {@link java.util.stream.IntStream#count() count()}という複数の形式の、特定の目的のための簡約処理も備える。

source: The sum returned can vary depending upon the order in which values are recorded, due to accumulated rounding error in addition of values of differing magnitudes.
ja: 返される和は、桁が異なる値の加算に由来する丸め誤差の累積のため、値が登録される順番によって変化する場合がある。

source: The supplier function for the new collector
ja: 新しいコレクタの供給関数

source: The three aspects of {@code collect} -- supplier, accumulator, and combiner -- are tightly coupled.
ja: {@code collect}の3つの側面、つまり供給関数・累積関数・統合関数は密に結合している。

source: The three-argument form is a generalization of the two-argument form, incorporating a mapping step into the accumulation step.
ja: この3引数形式は2引数形式の一般化であり、写像ステップを累積ステップに組み込んだものである。

source: The type of input elements for the new collector
ja: 新しいコレクタの入力要素の型

source: The type of intermediate accumulation result, and final result, for the new collector
ja: 新しいコレクタの中間累積結果および最終結果の型

source: The type of stream elements
ja: ストリーム要素の型

source: The type of the result
ja: 結果の型

source: The use of a {@code Supplier} in this form provides a level of indirection that reduces the scope of potential interference with the source.
ja: {@code Supplier}を利用するこの形式では、データ源との潜在的な干渉の範囲を減らすための1段階の間接参照が導入される。

source: The value of a floating-point sum is a function both of the input values as well as the order of addition operations.
ja: 浮動小数点の和は入力値と加算演算子の順序の両方の関数である。

source: The {@code Collection} is created by the provided factory.
ja: {@code Collection}は与えられたファクトリによって作成される。

source: The {@code ConcurrentMap} is created by a provided supplier function.
ja: {@code ConcurrentMap}は与えられた供給関数によって作成される。

source: The {@code ConcurrentMap} produced by the Collector is created with the supplied factory function.
ja: Collectorが生成する{@code ConcurrentMap}は与えられたファクトリ関数によって作成される。

source: The {@code Map} is created by a provided supplier function.
ja: {@code Map}は与えられた供給関数によって作成される。

source: The {@code Map} produced by the Collector is created with the supplied factory function.
ja: Collectorが生成する{@code Map}は与えられたファクトリ関数によって作成される。

source: The {@code accumulator} function acts as a fused mapper and accumulator, which can sometimes be more efficient than separate mapping and reduction, such as when knowing the previously reduced value allows you to avoid some computation.
ja: {@code accumulator}関数は写像関数と累積関数を融合した関数として振る舞うが、以前に簡約された値がわかれば計算を省ける場合などには、写像と簡約を分けた場合よりも効率的な場合がある。

source: The {@code accumulator} function must be an associative function.
ja: {@code accumulator}関数は結合的関数である必要がある。

source: The {@code double} format can represent all consecutive integers in the range -253 to 253.
ja: {@code double}形式は-253から253までの全ての連続する整数を表現できる。

source: The {@code flatMap()} operation has the effect of applying a one-to-many transformation to the elements of the stream, and then flattening the resulting elements into a new stream.
ja: {@code flatMap()}処理は1対多変換をストリームの各要素に適用し、結果の要素を新しいストリームに平坦化する効果を持つ。

source: The {@code identity} value must be an identity for the accumulator function.
ja: 値{@code identity}は累積関数の単位元である必要がある。

source: The {@code identity} value must be an identity for the combiner function.
ja: 値{@code identity}は統合関数の単位元である必要がある。

source: The {@code mapper} function passed to {@code flatMap} splits a line, using a simple regular expression, into an array of words, and then creates a stream of words from that array.
ja: {@code flatMap}に与えた{@code mapper}関数は行を簡単な正規表現を使って単語の配列に分割し、その配列から単語のストリームを作成する。

source: The {@code mapping()} collectors are most useful when used in a multi-level reduction, such as downstream of a {@code groupingBy} or {@code partitioningBy}.
ja: {@code mapping()}コレクタはマルチレベル簡約、つまり{@code groupingBy}や{@code partitioningBy}の下流で利用する際に最も有益となる。

source: The {@code reducing()} collectors are most useful when used in a multi-level reduction, downstream of {@code groupingBy} or {@code partitioningBy}.
ja: {@code reducing()}コレクタはマルチレベル簡約、つまり{@code groupingBy}や{@code partitioningBy}の下流で利用する際に最も有益となる。

source: The {@link Supplier#get()} method will be invoked on the supplier no more than once, and only after the terminal operation of the stream pipeline commences.
ja: 供給関数に対して{@link Supplier#get()}メソッドはストリームパイプラインの末端処理が開始した後に高々1回だけ呼ばれる。

source: The {@link java.util.stream.Stream#collect(Collector)} implementation will only perform a concurrent reduction if
ja: {@link java.util.stream.Stream#collect(Collector)}の実装は次の条件が満たされるときにのみ並行簡約を実施する。

source: Then a stream is created from that list.
ja: そしてストリームがそのリストから作成される。

source: Then this stream is summed to produce a total weight.
ja: そして重さの総計を求めるためにこのストリームの和が求められる。

source: There are a number of implementation choices in implementing a spliterator, nearly all of which are tradeoffs between simplicity of implementation and runtime performance of streams using that spliterator.
ja: それらのほとんどは実装の単純さとそのスプリッテレータを使うストリームの実行時のパフォーマンスとのトレードオフである。

source: There are many existing classes in the JDK whose signatures are well-suited for use with method references as arguments to {@code collect()}.
ja: JDKには{@code collect()}の引数としてメソッド参照としての利用によく適合したシグネチャを持つ既存のクラスが多くある。

source: There are multiple ways to deal with collisions between multiple elements mapping to the same key.
ja: 同じキーに写像される要素間の衝突を処理する方法は複数ある。

source: There are no guarantees on the type, mutability, or serializability of the {@code Map} or {@code List} objects returned, or of the thread-safety of the {@code List} objects returned.
ja: 返される{@code Map}や{@code List}オブジェクトに対する、型・可変性・直列化可能性の保証は無く、返される{@code List}オブジェクトに対するスレッド安全性の保障はない。

source: There are no guarantees on the type, mutability, serializability, or thread-safety of the {@code List} returned; if more control over the returned {@code List} is required, use {@link #toCollection(Supplier)}.
ja: 返される{@code List}に対する、型・可変性・直列化可能性・スレッド安全性の保証は無い。もし返される{@code List}についての制御権が必要であれば、{@link #toCollection(Supplier)}を利用せよ。

source: There are no guarantees on the type, mutability, serializability, or thread-safety of the {@code Map} or {@code List} objects returned.
ja: 返される{@code Map}や{@code List}オブジェクトに対する、型・可変性・直列化可能性・スレッド安全性の保証は無い。

source: There are no guarantees on the type, mutability, serializability, or thread-safety of the {@code Map} returned.
ja: 返される{@code Map}オブジェクトに対する、型・可変性・直列化可能性・スレッド安全性の保証は無い。

source: There are no guarantees on the type, mutability, serializability, or thread-safety of the {@code Set} returned; if more control over the returned {@code Set} is required, use {@link #toCollection(Supplier)}.
ja: 返される{@code Set}に対する、型・可変性・直列化可能性・スレッド安全性の保証は無い。もし返される{@code List}についての制御権が必要であれば、{@link #toCollection(Supplier)}を利用せよ。

source: Therefore, even when executed in parallel with non-thread-safe data structures (such as {@code ArrayList}), no additional synchronization is needed for a parallel reduction.
ja: そのため({@code ArrayList}などの)スレッドセーフでないデータ構造に対して並列に実行されたとしても、並列簡約のために追加の同期処理は必要ない。

source: These reduction operations can run safely in parallel with almost no modification:
ja: これらの簡約演算はほとんど変更せずとも安全に並列に実行できる。

source: These requirements significantly reduce the scope of potential interference between mutations of the stream source and execution of stream pipelines.
ja: これらの条件はストリーム源の変更とストリームパイプラインの実行の間で潜在的な干渉が起きる範囲を大幅に低減する。

source: They are always lazy; executing an intermediate operation such as {@code filter()} does not actually perform any filtering, but instead creates a new stream that, when traversed, contains the elements of the initial stream that match the given predicate.
ja: それらは常に遅延的(lazy)である。{@link java.util.stream.Stream#filter Stream.filter}のような中間処理を実行しても実際の絞り込みは実行されず、代わりに最初の{@code Stream}の要素のうち与えられた{@code Predicate}にマッチする要素を(走査した際に)含む新しい{@code Stream}を作成する。

source: They are:
ja: その4つの関数とは次の通りである。

source: This allows the creation of a {@code Stream} by generating elements individually and adding them to the {@code Builder} (without the copying overhead that comes from using an {@code ArrayList} as a temporary buffer.)
ja: これにより要素を個別に生成して{@code StreamBuilder}へ追加して({@code ArrayList}を一時バッファとして使った場合の複製のオーバーヘッド無しに){@code Stream}を作成できるようになる。

source: This can be concisely expressed with an array constructor reference:
ja: これは配列コンストラクタへの参照を使って簡潔に表せる。

source: This class is mostly for library writers presenting stream views of data structures; most static stream methods intended for end users are in the various {@code Stream} classes.
ja: このクラスは専らデータ構造に対してストリームとしてのビューを提供するライブラリ作者のためにある。一般利用者向けのほとんどの静的ストリームメソッドは各種{@code Stream}クラスにある。

source: This code unnecessarily uses side-effects.
ja: このコードは不必要に副作用を利用している。

source: This enables collection to occur in parallel without the {@code Collector} needing to implement any additional synchronization.
ja: これにより{@code Collector}が余分な同期処理を実装しなくても収集を並列に実行できるようになる。

source: This execution mode is a property of the stream.
ja: この実行モードはストリームの特性である。

source: This is a short-circuiting stateful intermediate operation.
ja: これは短絡的で状態を持つ中間処理である。

source: This is a short-circuiting terminal operation.
ja: これは短絡的で状態を持つ末端処理である。

source: This is a stateful intermediate operation.
ja: これは状態を持つ中間処理である。

source: This is a terminal operation.
ja: これは末端処理である。

source: This is a generalization of {@link #reducing(Object, BinaryOperator)} which allows a transformation of the elements before reduction.
ja: これは{@link #reducing(Object, BinaryOperator)}の一般化であり、簡約の前に要素の変換を許す。

source: This is a special case of a reduction and is equivalent to:
ja: これは簡約の特殊な場合であり、次のコードと等しい。

source: This is a special case of a reduction.
ja: これは簡約の特別な場合である。

source: This is a {@link Collector.Characteristics#CONCURRENT concurrent} and {@link Collector.Characteristics#UNORDERED unordered} Collector.
ja: これは{@link Collector.Characteristics#CONCURRENT 並行}で{@link Collector.Characteristics#UNORDERED 順序を持たない}Collectorである。

source: This is an intermediate operation.
ja: これは中間処理である。

source: This is an {@link Collector.Characteristics#UNORDERED unordered} Collector.
ja: これは{@link Collector.Characteristics#UNORDERED 順序を持たない}Collectorである。

source: This is because the combining step (merging one {@code Map} into another by key) can be expensive for some {@code Map} implementations.
ja: これは統合段階({@code Map}をキーに従って他のマップに統合する)の処理はある種の{@code Map}の実装では高価となるためである。

source: This is equivalent to:
ja: これは次と等しい。

source: This is possible only if we can prevent interference with the data source during the execution of a stream pipeline.
ja: これはストリームパイプラインを実行している間、情報源に対する<em>干渉(interference)</em>を防げる場合のみ可能となる。

source: This is suitable for generating constant streams, streams of random elements, etc.
ja: 定数のストリームや乱数のストリームなどを生成するのに向いている。

source: This is the {@code double} primitive specialization of {@link Stream}.
ja: これはプリミティブの{@code double}に特化した{@link Stream}である。

source: This is the {@code int} primitive specialization of {@link Stream}.
ja: これはプリミティブの{@code int}に特化した{@link Stream}である。

source: This is the {@code long} primitive specialization of {@link Stream}.
ja: これはプリミティブの{@code long}に特化した{@link Stream}である。

source: This is to allow for maximal performance in parallel operations; the cost is that multiple invocations on the same source may not return the same result.
ja: これにより並列実行時の性能を最大化できる。その際のコストは同じ情報源に対する複数回の呼び出しが同じ値を返さないことである

source: This means that for all {@code t}, {@code accumulator.apply(identity, t)} is equal to {@code t}.
ja: つまり、任意の{@code t}に対して{@code accumulator.apply(identity, t)}は{@code t}と等しい。

source: This means that for all {@code u}, {@code combiner(identity, u)} is equal to {@code u}.
ja: つまり任意の{@code u}に対して、{@code combiner.apply(identity, u)}が{@code u}に等しいということである。

source: This means that for all {@code u}, {@code combiner.apply(identity, u)} is equal to {@code u}.
ja: つまり任意の{@code u}に対して、{@code combiner.apply(identity, u)}が{@code u}に等しいということである。

source: This means that for all {@code x}, {@code accumulator.apply(identity, x)} is equal to {@code x}.
ja: つまり、任意の{@code x}に対して{@code accumulator.apply(identity, x)}は{@code x}と等しい。

source: This method evaluates the existential quantification of the predicate over the elements of the stream (for some x P(x)).
ja: このメソッドはこのストリームの要素に対して述語の存在限量子(あるxについてP(x))を評価する。

source: This method evaluates the universal quantification of the negated predicate over the elements of the stream (for all x ~P(x)).
ja: このメソッドはこのストリームの要素に対して述語の否定の全称限量子(全てのxについて~P(x))を評価する。

source: This method evaluates the universal quantification of the predicate over the elements of the stream (for all x P(x)).
ja: このメソッドはこのストリームの要素に対して述語の全称限量子(全てのxについてP(x))を評価する。

source: This method exists mainly to support debugging, where you want to see the elements as they flow past a certain point in a pipeline:
ja: このメソッドは主にデバッグの補助のために、パイプラインのある点を通過する要素を調べたいときのために存在する。

source: This method may be implemented using compensated summation or other technique to reduce the error bound in the {@link #sum numerical sum} used to compute the average.
ja: 特に、このメソッドは平均を計算するために使われる{@link #sum 数値和}の誤差の限度を減らすための補償付き和や他の技術を使って実装される場合がある。

source: This operation processes the elements one at a time, in encounter order if one exists.
ja: この処理では出現順順序がある場合、出現順に従って要素を一度に1つずつ処理する。

source: This potentially provides a boost to the parallel execution performance.
ja: これを並行簡約と呼ぶ。

source: This produces a result equivalent to:
ja: これは次のコードと同じ結果を生成する。

source: This produces a result similar to:
ja: これは次のコードと似た結果を生成する。

source: This rules out, for example, "forked" streams, where the same source feeds two or more pipelines, or multiple traversals of the same stream.
ja: これは例えば「分岐」したストリームを認めない、つまり同じ情報源から複数のパイプラインに要素を供給したり、同じストリームを複数回走査するといったことを認めないということである。

source: This set should be immutable.
ja: この集合は不変であるべきである。

source: To ensure that sequential and parallel executions produce equivalent results, the collector functions must satisfy an identity and an associativity constraints.
ja: 逐次的な実行と並列実行が等価な結果を作成するよう保障するためには、集約関数は単位元と結合性に関する制約を満たす必要がある。

source: To execute the prior "sum of weights of widgets" query in parallel, we would do:
ja: 前述の「ウィジェットの重さの合計」を問い合わせる処理を並列にするには次のようにする。

source: To perform a computation, stream operations are composed into a stream pipeline.
ja: 計算を実行するために、ストリーム処理は組み立てられて1つのストリームパイプラインへと合成される。

source: To perform a simple map-reduce on a stream, use {@link Stream#map(Function)} and {@link Stream#reduce(Object, BinaryOperator)} instead.
ja: ストリームに対して単純な写像・簡約を実行する場合は代わりに{@link Stream#map(Function)}と{@link Stream#reduce(Object, BinaryOperator)}を使用せよ。

source: To perform a simple reduction on a stream, use {@link Stream#reduce(BinaryOperator)} instead.
ja: ストリームに対して単純な簡約を実行する場合は代わりに{@link Stream#reduce(BinaryOperator)}を使用せよ。

source: To perform a simple reduction on a stream, use {@link Stream#reduce(Object, BinaryOperator)}} instead.
ja: ストリームに対して単純な簡約を実行する場合は代わりに{@link Stream#reduce(Object, BinaryOperator)}を使用せよ。

source: To preserve correct behavior, these behavioral parameters must be non-interfering, and in most cases must be stateless.
ja: 挙動の正しさを維持するためには、それらの挙動パラメータ(behavioral parameter)は非干渉的(non-interfering)である必要があり、さらに多くの場合は状態を持たない(stateless)必要がある。

source: To preserve correct behavior, these behavioral parameters:
ja: 正しい動作を保つため、それらの挙動パラメータ(behavioral parameters)は次の条件を満たす必要がある。

source: Traversal of the pipeline source does not begin until the terminal operation of the pipeline is executed.
ja: パイプラインの末端処理が実行されるまでパイプラインのデータ源の走査は始まらない。

source: Unless otherwise specified these parameters must be non-null.
ja: 特に別記されてない限り、それらのパラメータはnullではいけない。

source: Unless the source was explicitly designed for concurrent modification (such as a {@link ConcurrentHashMap}), unpredictable or erroneous behavior may result from modifying the stream source while it is being queried.
ja: 情報源が({@link ConcurrentHashMap}などのように)並行的な変更のために特別に設計されている場合を除き、問い合わせ中にストリーム源を変更すると予測できない挙動や誤った挙動となる場合がある。

source: Unless the stream source is concurrent, modifying a stream's data source during execution of a stream pipeline can cause exceptions, incorrect answers, or nonconformant behavior.
ja: ストリームの情報源が並行でない限り、ストリームパイプラインの実行中にストリームの情報源を変更すると例外・不正な答え・一般的でない結果を引き起こす。

source: Unlike the numerical comparison operators, this method considers negative zero to be strictly smaller than positive zero.
ja: 数値比較演算子と異なり、このメソッドは負の零は正の零よりも真に小さいとみなす。

source: Use caution when constructing streams from repeated concatenation.
ja: 連結の繰り返しによりストリームを構築する際には注意が必要である。

source: Using an unordered stream source (such as {@link #generate(DoubleSupplier)}) or removing the ordering constraint with {@link #unordered()} may result in significant speedups of {@code limit()} in parallel pipelines, if the semantics of your situation permit.
ja: メソッドを使う状況が許すならば、順序を持たないストリーム源({@link #generate(DoubleSupplier)}など)を使うか、{@link #unordered()}により順序の制約を外すと並列パイプラインにおいて{@code limit()}の実行を大幅に効率化できる場合がある。

source: Using an unordered stream source (such as {@link #generate(DoubleSupplier)}) or removing the ordering constraint with {@link #unordered()} may result in significant speedups of {@code skip()} in parallel pipelines, if the semantics of your situation permit.
ja: メソッドを使う状況が許すならば、順序を持たないストリーム源({@link #generate(DoubleSupplier)}など)を使うか、{@link #unordered()}により順序の制約を外すと並列パイプラインにおいて{@code skip()}の実行を大幅に効率化できる場合がある。

source: Using an unordered stream source (such as {@link #generate(IntSupplier)}) or removing the ordering constraint with {@link #unordered()} may result in significant speedups of {@code limit()} in parallel pipelines, if the semantics of your situation permit.
ja: メソッドを使う状況が許すならば、順序を持たないストリーム源({@link #generate(IntSupplier)}など)を使うか、{@link #unordered()}により順序の制約を外すと並列パイプラインにおいて{@code limit()}の実行を大幅に効率化できる場合がある。

source: Using an unordered stream source (such as {@link #generate(IntSupplier)}) or removing the ordering constraint with {@link #unordered()} may result in significant speedups of {@code skip()} in parallel pipelines, if the semantics of your situation permit.
ja: メソッドを使う状況が許すならば、順序を持たないストリーム源({@link #generate(IntSupplier)}など)を使うか、{@link #unordered()}により順序の制約を外すと並列パイプラインにおいて{@code skip()}の実行を大幅に効率化できる場合がある。

source: Using an unordered stream source (such as {@link #generate(LongSupplier)}) or removing the ordering constraint with {@link #unordered()} may result in significant speedups of {@code limit()} in parallel pipelines, if the semantics of your situation permit.
ja: メソッドを使う状況が許すならば、順序を持たないストリーム源({@link #generate(LongSupplier)}など)を使うか、{@link #unordered()}により順序の制約を外すと並列パイプラインにおいて{@code limit()}の実行を大幅に効率化できる場合がある。

source: Using an unordered stream source (such as {@link #generate(LongSupplier)}) or removing the ordering constraint with {@link #unordered()} may result in significant speedups of {@code skip()} in parallel pipelines, if the semantics of your situation permit.
ja: メソッドを使う状況が許すならば、順序を持たないストリーム源({@link #generate(LongSupplier)}など)を使うか、{@link #unordered()}により順序の制約を外すと並列パイプラインにおいて{@code skip()}の実行を大幅に効率化できる場合がある。

source: Using an unordered stream source (such as {@link #generate(Supplier)}) or removing the ordering constraint with {@link #unordered()} may result in significant speedups of {@code limit()} in parallel pipelines, if the semantics of your situation permit.
ja: メソッドを使う状況が許すならば、順序を持たないストリーム源({@link #generate(Supplier)}など)を使うか、{@link #unordered()}により順序の制約を外すと並列パイプラインにおいて{@code limit()}の実行を大幅に効率化できる場合がある。

source: Using an unordered stream source (such as {@link #generate(Supplier)}) or removing the ordering constraint with {@link #unordered()} may result in significant speedups of {@code skip()} in parallel pipelines, if the semantics of your situation permit.
ja: メソッドを使う状況が許すならば、順序を持たないストリーム源({@link #generate(Supplier)}など)を使うか、{@link #unordered()}により順序の制約を外すと並列パイプラインにおいて{@code skip()}の実行を大幅に効率化できる場合がある。

source: Using an unordered stream source (such as {@link #generate(Supplier)}) or removing the ordering constraint with {@link #unordered()} may result in significantly more efficient execution for {@code distinct()} in parallel pipelines, if the semantics of your situation permit.
ja: メソッドを使う状況が許すならば、順序を持たないストリーム源({@link #generate(Supplier)}など)を使うか、{@link #unordered()}により順序の制約を外すと並列パイプラインにおいて{@code distinct()}の実行を大幅に効率化できる場合がある。

source: Values sorted by increasing absolute magnitude tend to yield more accurate results.
ja: 絶対値が小さい順に整列するとより正確な値を出す傾向がある。

source: We can use the abstraction of a {@link java.util.stream.Collector} to capture all three aspects.
ja: {@link java.util.stream.Collector}という概念を使うとこの3つの側面を全て捉えられる。

source: We can use the same technique to parallelize mutable reduction as we do with ordinary reduction.
ja: 可変的簡約の並列化には通常の簡約の際と同じ手法が使える。

source: We could re-cast the simple sum-of-weights example using the more general form as follows:
ja: 単純な重量の合計の例はより一般的な形式を使い次のように再構成できる。

source: We create a stream of {@code Widget} objects via {@link Collection#stream Collection.stream()}, filter it to produce a stream containing only the red widgets, and then transform it into a stream of {@code int} values representing the weight of each red widget.
ja: ここでは{@code Widget}オブジェクトのストリームを{@link Collection#stream Collection.stream()}で作成し、赤いウィジェットのみを含むストリームを作成するために絞り込み、それを赤い各ウィジェットの重さを表す{@code int}のストリームに変換する。

source: We would get the desired result, and it would even work in parallel.
ja: これでも望む結果は得られるし、並列にも動作できる。

source: We would then be constrained to implement either a sequential reduction or a merge-based parallel reduction.
ja: その場合、逐次簡約か統合ベースの並列簡約に制限される。

source: When executed in parallel, multiple intermediate results may be instantiated, populated, and merged so as to maintain isolation of mutable data structures.
ja: 並列に実行された場合、可変なデータ構造の隔離を維持するために複数の中間結果がインスタンス化され、満たされ、併合される。

source: When the resulting stream is closed, the close handlers for both input streams are invoked.
ja: 結果のストリームが閉じられた場合、両方の入力ストリームを閉じるハンドラが呼び出される。
